# YOLOv8 object detection model with P3/8 - P5/32 outputs.
# Pulled verbatim from ultralytics/cfg/models/v8/yolov8.yaml.
# Edit this file to change topology; see yolov8/model.py:parse_model for the
# interpretation of `[from, repeats, module, args]`.

nc: 80  # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]   # 3,157,200 params,  8.9 GFLOPs
  s: [0.33, 0.50, 1024]   # 11,166,560 params, 28.8 GFLOPs
  m: [0.67, 0.75,  768]   # 25,902,640 params, 79.3 GFLOPs
  l: [1.00, 1.00,  512]   # 43,691,520 params, 165.7 GFLOPs
  x: [1.00, 1.25,  512]   # 68,229,648 params, 258.5 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]         # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]        # cat backbone P4
  - [-1, 3, C2f, [512]]              # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]        # cat backbone P3
  - [-1, 3, C2f, [256]]              # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]       # cat head P4
  - [-1, 3, C2f, [512]]              # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]        # cat head P5
  - [-1, 3, C2f, [1024]]             # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
